HOCOOH/STM32-Authentication/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "i2c.h"
#include "usart.h"
#include "gpio.h"
#include "string.h"
#include "SM3.h"
#include "stdlib.h"
#include "flash.h"

/* USER CODE BEGIN Includes */
#include "zlg7290.h"
#include "stdio.h"
#include <time.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define ZLG_READ_ADDRESS1         0x01
#define ZLG_READ_ADDRESS2         0x10
#define ZLG_WRITE_ADDRESS1        0x10
#define ZLG_WRITE_ADDRESS2        0x11
#define BUFFER_SIZE1              (countof(Tx1_Buffer))
#define BUFFER_SIZE2              (countof(Rx2_Buffer))
#define countof(a) (sizeof(a) / sizeof(*(a)))

#define FLASH_ADDR_BASE 0x080E0000
#define ALIGN_PASSWD_BACKUP 0x100
#define ADDR_PASSWD_BACKUP(i) (FLASH_ADDR_BASE + ((i) * ALIGN_PASSWD_BACKUP))

/*
#define MAX_USERNAME_LEN 6
#define MIN_USERNAME_LEN 3
#define MAX_PASSWORD_LEN 8
#define MIN_PASSWORD_LEN 5
#define N_WORKER 5
*/

#define N_STATE 6
#define STATE_INIT 0
#define STATE_WAIT 1
#define STATE_INPUT 2
#define STATE_CHECK 3
#define STATE_EDIT 4
#define STATE_EXCEPTION 5

#define EXCEPT_UNVALIAD_STATE 1
#define EXCEPT_TIMEOUT 2
#define EXCEPT_PASSLEN_LONG 3
#define EXCEPT_PASSLEN_SHORT 4

#define MAX_PASSWORD_LEN 12
#define MIN_PASSWORD_LEN 5
#define DIGEST_LEN 32
#define PASSWD_LEN_U32 ((DIGEST_LEN + 4) / 4)

#define REFRESH_COUNT_INIT 500
#define HOT_BOOT_FLAG 0x1234ABCD
#define TIMEOUT_THRESHOLD 5

#define N_BACKUP 3

typedef struct {
    u8 currentState;
    u8 lastState;
    u8 errorCode;
} State;

typedef struct {
    u8 hashVal[DIGEST_LEN + 1];
    u8 CRCVal;
    u8 align[2];
} Passwd;

u32 boot_flag __attribute__((at(0x10000004)));

u32 refreshCount __attribute__((at(0x1000000C))) = 0;
u8 hashMark __attribute__((at(0x10000014))) = 0;
State state __attribute__((at(0x1000001C))) = {STATE_INIT, STATE_EXCEPTION, 0} ;
State stateBackup[N_BACKUP + 1] __attribute__((at(0x10000034))) = {0};
uint8_t flag __attribute__((at(0x10000094)));//不同的按键有不同的标志位值
uint8_t flagInterrupt __attribute__((at(0x1000009C))) = 0;//中断标志位，每次按键产生一次中断，并开始读取8个数码管的值
uint8_t Rx2_Buffer[8] __attribute__((at(0x100000A4)))  ={0};
uint8_t Tx1_Buffer[8] __attribute__((at(0x100000E4)))  ={0};
uint8_t Rx1_Buffer[1] __attribute__((at(0x10000124)))  ={0};
uint8_t edit_mode __attribute__((at(0x1000012C)))  = 0;
uint64_t time_count __attribute__((at(0x10000134)))  = 0;
double delay_choices[] __attribute__((at(0x1000013C))) = {5, 10, 15};
uint8_t pass_buf[MAX_PASSWORD_LEN + 1] __attribute__((at(0x10000174))) = {0};
uint8_t pass_buf_sm3[DIGEST_LEN + 1] __attribute__((at(0x1000013C))) = {0};

u8 passwdDefault[MAX_PASSWORD_LEN + 1] = {0x1, 0x2, 0x3, 0x4, 0x5, 0x6, 0, 0};

// uint8_t pass_store_sm3[DIGEST_LEN + 1] = {0};
// u32 passwdCRC = 0;

Passwd passwdRAM = {0};
// u8 passwdBackupSM3[N_BACKUP + 1][DIGEST_LEN + 1] = {0};
// u32 passwdCRCBackup[N_BACKUP + 1] = {0};
u8 prev_state_table[N_STATE][N_STATE] = {	
									{0, 0, 0, 0, 0, 1}, 
									{1, 0, 1, 1, 1, 0},
									{0, 1, 0, 0, 0, 0},
									{0, 0, 1, 0, 0, 0},
									{0, 0, 1, 0, 0, 0},
									{1, 1, 1, 1, 1, 0} }; // exception待添加
uint8_t input_cursor = 0;

// cold boot and hot boot

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void swtich_key(void);
void switch_flag(void);
void disp_str(uint8_t* code);
uint8_t cmp(uint8_t* arr1, uint8_t* arr2, uint8_t len);
uint32_t len(uint8_t* arr);
void disp_in_serial(uint8_t* arr);
void UpdateState(u8 nextState);
u8 IsStateValid(u8 expectState);
void rand_delay();
void UpdatePasswdBackup();
u8 IsPasswdValid();
u8 ResumePasswd(u8* validMask, Passwd* tmpPasswd);
void mymemcpy(void* dest, const void* src, u32 len);
void delay_ms(u32 time);
uint8_t crc4_itu(uint8_t *data, uint16_t length);

int main(void) {
		
