HOCOOH/STM32-Authentication/Src/main.c
    if (boot_flag != HOT_BOOT_FLAG) {
        // cold boot
		boot_flag = HOT_BOOT_FLAG;
        // init
        state.currentState = STATE_INIT;
        state.lastState = STATE_EXCEPTION;
        state.errorCode = 0;

        /* 冷启动恢复密码 */
        if (IsPasswdValid()) {
            printf("存储的密码损坏且无法恢复\n\r");
            while (1) {}
        }
        // SM3_Hash(passwdDefault, len(passwdDefault), (void*)passwdRAM.hashVal);
        // UpdatePasswdBackup();



    } else {
        // hot boot
        // load the backend vars and check

    }
    
    // printf("\n\r");
    // printf("\n\r===================================\n\r");
    printf("\n\r FS-STM32身份验证系统\n\r");
    // printf("\n\r test : len(pass_store):%d\n\r", len(pass_store));
    // printf("\n\r test : pass_store:\n\r");
    // disp_in_serial(pass_store);
    
    // SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
    // printf("SM3哈希后的pass_store:\n\r");
    // disp_in_serial(pass_store_sm3);
    // printf("\n\r");

    // 主循环
    while (1) {
        /* 初始化状态 */
        if (state.currentState == STATE_INIT) {
            /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
            HAL_Init();

            /* Configure the system clock */
            SystemClock_Config();

            /* Initialize all configured peripherals */
            MX_GPIO_Init();
            MX_I2C1_Init();
            MX_USART1_UART_Init();
            //MX_CRC_Init();

            // write pass_store from flash
            // STMFLASH_Write(PASS_STORE_ADDR, pass_test, MAX_PASSWORD_LEN);
            // u32 pass_read_test[MAX_PASSWORD_LEN  + 1];
            // STMFLASH_Read(PASS_STORE_ADDR, pass_read_test, MAX_PASSWORD_LEN);
            // printf("After read!\n");
            // printf("%x %x %x %x\n",pass_read_test[0], pass_read_test[1], pass_read_test[2],pass_read_test[3]);


            /* Initialize variables */
            refreshCount = REFRESH_COUNT_INIT;
            input_cursor = 0;
			edit_mode = 0;
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                pass_buf[i] = 0;
            }

            rand_delay();

            // switch to state wait
            UpdateState(STATE_WAIT);
        }
        /* 待机状态 */
        else if (state.currentState == STATE_WAIT) {
            rand_delay();
            if (IsStateValid(STATE_WAIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            input_cursor = 0;
            /* 检测到输入，转到输入状态 */
            if (flagInterrupt == 1) {
                UpdateState(STATE_INPUT);
                continue;
            }
            // set refresh timer 
            if (refreshCount-- == 0) {
                //UpdateState(STATE_INIT);
                //continue;
            }
        }
        /* 输入状态 */
        else if (state.currentState == STATE_INPUT) {
            rand_delay();
            if (IsStateValid(STATE_INPUT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
						
						time_count = 0;
            // get input 
            while (input_cursor < MAX_PASSWORD_LEN) {
							
								if (time_count > 5000000 * TIMEOUT_THRESHOLD) {
									time_count = 0;
									state.errorCode = EXCEPT_TIMEOUT;
                  UpdateState(STATE_EXCEPTION); // return wait state 
									goto expcetion_handler;
								}
								
                if(flagInterrupt == 1) {
                    flagInterrupt = 0;
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x01,Rx1_Buffer,1);	//读键值
                    swtich_key();	//扫描键值，写标志位
                    I2C_ZLG7290_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);	//读8位数码管
                    switch_flag();	//扫描到相应的按键并且向数码管写进数值
                    printf("flag: %d\n\r", flag);

                    if (flag == 14) {// #
                        printf("Password input done!\n\r");
                        hashMark = 0;
                        break;
                    }
                    else if (flag == 16 && hashMark == 0) { // *
                        printf("Edit password\n\r");
                        hashMark = 1;
                        break;
                    }
                    else {
                        pass_buf[input_cursor++] = flag;
                    }
										time_count = 0;
              // todo: 异常!!!:无效的字?
									}
								time_count++;
							}
            
						pass_buf[input_cursor] = 0;
            // 异常: 密码长度过长
            if (input_cursor >= MAX_PASSWORD_LEN) {
                printf("Password is too long\n\r");
                state.errorCode = EXCEPT_PASSLEN_LONG;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // 异常: 密码长度过短
            else if (input_cursor < MIN_PASSWORD_LEN) {
                printf("Password is too short\n\r");
                state.errorCode = EXCEPT_PASSLEN_SHORT;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // todo: 重复输入**********************
						IsStateValid(STATE_INPUT);
						printf("editmode:%d\n", edit_mode);
            /* 输入合法 */
            if (edit_mode == 1) {
                UpdateState(STATE_EDIT);
            }
            else {
				UpdateState(STATE_CHECK);
            }
        }
        /* 判断密码状态 */
        else if (state.currentState == STATE_CHECK) {
            rand_delay();
            if (IsStateValid(STATE_CHECK)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }
            // printf("\n\rlen: %d  ", input_cursor);
            // printf("pass_buf:\n\r");
            // disp_in_serial(pass_buf);
            /* 对输入的密码进行SM3摘要 */
            SM3_Hash(pass_buf, len(pass_buf), (void*)pass_buf_sm3);
            printf("SM3 hash value of pass_buf: ");
            disp_in_serial(pass_buf_sm3);
            printf("SM3 hash value of pass_store: ");
            disp_in_serial(passwdRAM.hashVal);
            
            /* 比对输入摘要和真实密码摘要 */
            if (IsPasswdValid()) {
                printf("存储的密码损坏且无法恢复\n\r");
                while (1) {}
            }
            int cmp_res = cmp(pass_buf_sm3, passwdRAM.hashVal, input_cursor);
            if (cmp_res == 0) { // 匹配
                // 显示success
                printf("password match!\n\r");
                uint8_t success_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(success_code);
            
            } else { // 不匹配
                // 显示error
                printf("password not match!\n\r");
                // todo: edit code
                uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
                disp_str(error_code);
            }
            
            /* 返回待机状态 */
            edit_mode = hashMark;
            UpdateState(STATE_WAIT);
        }
        /* 修改密码状态 */
        else if (state.currentState == STATE_EDIT) {
            rand_delay();
            if (IsStateValid(STATE_EDIT)) {
                state.errorCode = EXCEPT_UNVALIAD_STATE;
                UpdateState(STATE_EXCEPTION);
                continue;
            }

